app/controllers/search_controller.rb

SELECT "tags".* FROM "tags" WHERE (title LIKE '%two%' OR comment LIKE '%two%')
---
  def index
    query = params[:q]
    @tags = Tag.where('title LIKE :query
      OR category LIKE :query OR comment LIKE :query',
      query: "%#{query}%")