app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    safe_tag = params.require(:tag).permit(:title, :category, :comment)
    @tag = current_user.tags.create safe_tag
---
INSERT INTO "tags" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 22 Dec 2013 21:56:13 UTC +00:00], ["updated_at", Sun, 22 Dec 2013 21:56:13 UTC +00:00]]

  def show
    @tag = Tag.find params[:id]
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    @tag = Tag.find params[:id]
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "#<ActiveRecord::Associations::CollectionProxy::ActiveRecord_Associations_CollectionProxy_Tag:0x0000010307b8f0>"]]

  def update
    safe_tag = params.require(:tag).permit(:title, :category, :comment)
    @tag = current_user.tags.create safe_tag
---
INSERT INTO "tags" ("category", "comment", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)