app/controllers/tags_controller.rb

  def set_tag
    @tag = Tag.find params[:id]
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", "2"]]